Renova/src/Documents/ОтчетОПродажахИПроизводстве/ОтчетОПродажахИПроизводстве.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетОПродажахИПроизводстве</name>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.Производство</registerRecords>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.ВидДокументаПродажиИПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокВидовПродукции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фабрика</name>
    <type>
      <types>CatalogRef.ФабрикиИСмены</types>
    </type>
  </attributes>
  <attributes>
    <name>Фирма</name>
    <type>
      <types>CatalogRef.Фирмы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ВидПродукции</name>
      <type>
        <types>CatalogRef.ВидыПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МесяцУчета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.МоделиПродукции</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Renova/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоПродано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПроизведено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидПродукции</name>
    <type>
      <types>CatalogRef.ВидыПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МоделиПродукции</name>
    <type>
      <types>CatalogRef.МоделиПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Фирма</name>
    <type>
      <types>CatalogRef.Фирмы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МесяцПродаж</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Renova/src/AccumulationRegisters/Производство/Производство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Производство</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоПродано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПроизведено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидПродукции</name>
    <type>
      <types>CatalogRef.ВидыПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МоделиПродукции</name>
    <type>
      <types>CatalogRef.МоделиПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Фабрика</name>
    <type>
      <types>CatalogRef.ФабрикиИСмены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МесяцПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Renova/src/Documents/ОтчетОПродажахИПроизводстве/ObjectModule.bsl
#Если Сервер или ТолстыйКлиентОбычноеПриложение или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		НачалоПериода = НачалоМесяца(ТекущаяУниверсальнаяДата());
		КонецПериода = НачалоПериода;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
		
   	// Получаем списко видов продукции без повторений
   	ТаблицаВидовПродукции = Товары.Выгрузить( , "ВидПродукции");
   	ТаблицаВидовПродукции.Свернуть("ВидПродукции");
   	МассивВидовПродукции = ТаблицаВидовПродукции.ВыгрузитьКолонку("ВидПродукции");
   	СписокВидовПродукции = СтрСоединить(МассивВидовПродукции, ", ");

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ЭтоПродажи = (ВидДокумента = Перечисления.ВидДокументаПродажиИПроизводство.Продажи);	

    // Получаем соответствие запрещенных комбинаций (ключ -> дата более позднего документа)
    ЗапрещенныеКомбинации = ПолучитьЗапрещенныеКомбинации(ЭтоПродажи);

    // Начинаем формирование движений
	Если ЭтоПродажи Тогда
    	Движения.Продажи.Записывать = Истина;
	Иначе
		Движения.Производство.Записывать = Истина;
	КонецЕсли;

    КоличествоЗапрещено = 0;
    КоличествоПерезаписано = 0;

    Для Каждого ТекСтрокаТовары Из Товары Цикл

        // Пропускаем строки с незаполненными обязательными реквизитами
        Если Не ЗначениеЗаполнено(ТекСтрокаТовары.Номенклатура) Или
           Не ЗначениеЗаполнено(ТекСтрокаТовары.Количество) Тогда
            Продолжить;
        КонецЕсли;
		
		Если ЗапрещенныеКомбинации.Количество() > 0 Тогда
			// Формируем ключ для проверки (единый формат для обеих сторон)
			Ключ = Строка(ТекСтрокаТовары.Номенклатура) + "|" + Формат(ТекСтрокаТовары.МесяцПродаж, "ДФ=yyyyMMdd");
		КонецЕсли;
		
        // Проверяем, есть ли более поздняя запись в регистре
        Если ЗапрещенныеКомбинации.Получить(Ключ) <> Неопределено Тогда
            Сообщить("Строка по модели " + ТекСтрокаТовары.Номенклатура +
                      " за месяц " + Формат(ТекСтрокаТовары.МесяцУчета, "ДФ='MMMM yyyy';") +
                      " НЕ БУДЕТ ЗАПИСАНА, так как имеются более поздние данные (документ от " +
                      Формат(ЗапрещенныеКомбинации[Ключ], "Д") + ").");
            КоличествоЗапрещено = КоличествоЗапрещено + 1;
            Продолжить;
        КонецЕсли;

        // Создаём движение
		Если ЭтоПродажи Тогда
			Движение = Движения.Продажи.Добавить();
			Движение.Фирма = Фирма;    
		Иначе
			Движение = Движения.Производство.Добавить();
			Движение.Фабрика = Фабрика;    
		КонецЕсли;
		Движение.Период = Дата;
		Движение.МесяцУчета = ТекСтрокаТовары.МесяцУчета; 
		Движение.ВидПродукции = ТекСтрокаТовары.ВидПродукции;
		Движение.МоделиПродукции = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;

        КоличествоПерезаписано = КоличествоПерезаписано + 1;

    КонецЦикла;

    // Выводим итоговые сообщения
    Если КоличествоЗапрещено > 0 Тогда
        Сообщить("Внимание! Было пропущено " + КоличествоЗапрещено + " строк(и) из-за наличия более поздних записей.");
    КонецЕсли;

    Если КоличествоПерезаписано > 0 Тогда
        Сообщить("Записано " + КоличествоПерезаписано + " строк(и). Старые данные (если были) перезаписаны.");
	Иначе
		Сообщить("Нет данных для проведения документа"); 
		Отказ = Истина;
    КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 


#Область СлужебныеПроцедурыИФункции 

Функция ПолучитьЗапрещенныеКомбинации(ЭтоПродажи)
	
  	МассивНоменклатуры = Товары.ВыгрузитьКолонку("Номенклатура");
	МассивМесяцев = Товары.ВыгрузитьКолонку("МесяцУчета");

    // Запрос к регистру для получения максимальной даты документа по каждой комбинации
    Если ЭтоПродажи Тогда
    	СтрокаРегистр = "РегистрНакопления.Продажи";
    Иначе
    	СтрокаРегистр = "РегистрНакопления.Производство";
    КонецЕсли;
    
    Запрос = Новый Запрос;
	Запрос.Текст = СтрШаблон("ВЫБРАТЬ
	               |	Регистр.МоделиПродукции КАК МоделиПродукции,
	               |	МАКСИМУМ(Регистр.Период) КАК Период,
	               |	Регистр.МесяцУчета КАК МесяцУчета
	               |ИЗ
	               |	%1 КАК Регистр
	               |ГДЕ
	               |	Регистр.МоделиПродукции В(&Модель)
	               |	И Регистр.МесяцУчета В(&Месяц)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Регистр.МоделиПродукции,
	               |	Регистр.МесяцУчета",
	               СтрокаРегистр); 
	
    Запрос.УстановитьПараметр("Модель", МассивНоменклатуры);
    Запрос.УстановитьПараметр("Месяц", МассивМесяцев);

    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();

    Запрет = Новый Соответствие;
    Пока Выборка.Следующий() Цикл
        Если Выборка.Период > Ссылка.Дата Тогда
            Ключ = Строка(Выборка.МоделиПродукции) + "|" + Формат(Выборка.МесяцУчета, "ДФ=yyyyMMdd");
            Запрет.Вставить(Ключ, Выборка.Период);
        КонецЕсли;
    КонецЦикла;

    Возврат Запрет;	
	
КонецФункции

#КонецОбласти


#КонецЕсли
